---
type: PointCloudColorSettings
namespace: Autodesk.Revit.DB.PointClouds
version: 2024
members: 8
tags: [revit-api, class]
---

# PointCloudColorSettings

`Autodesk.Revit.DB.PointClouds.PointCloudColorSettings` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PointCloudColorSettings | — | `` |
| Constructor | PointCloudColorSettings | 2014 | `public PointCloudColorSettings ()` |
| Method | Assign | 2014 | `public void Assign ( PointCloudColorSettings other )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsEqual | 2014 | `public bool IsEqual ( PointCloudColorSettings other )` |
| Property | Color1 | 2014 | `public Color Color1 { get ; }` |
| Property | Color2 | 2014 | `public Color Color2 { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |